# CircleLightShape Class

---
This class encapsulates a circle light shape.
SystemObject Autodesk.Revit.DB.LightingLightShape Autodesk.Revit.DB.LightingCircleLightShape
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class CircleLightShape : LightShape

    Public Class CircleLightShape
    	Inherits LightShape

    public ref class CircleLightShape : public LightShape

    type CircleLightShape =
        class
            inherit LightShape
        end
The CircleLightShape type exposes the following members.
| Name| Description
---|---|---
| CircleLightShape|  Creates a circle light shape object with 2.0' emit diameter.
| CircleLightShape(CircleLightShape)|  Creates a copy of the given circle light shape
| CircleLightShape(Double)|  Creates a circle light shape object with the given emit diameter.
Top
| Name| Description
---|---|---
| EmitDiameter|  The emit diameter.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape)
Top
| Name| Description
---|---|---
| Clone|  Creates a copy of the LightShape derived object. (Inherited from LightShape)
| Dispose| (Inherited from LightShape)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Lighting Namespace